{
  "system_version": "1.0.0",
  "system_name": "SEAA-TabulaRasa",
  "blueprint": {
    "soma.perception.observer": {
      "name": "soma.perception.observer",
      "description": "This organ will be responsible for scanning and analyzing the file system. It will periodically check for changes, identify new or modified files, and publish events containing information about these changes to the event bus. The observer will use Python's built-in libraries such as `os` and `watchdog` to monitor directories and files. When a change is detected, it will create an event with details like file path, type of change (created, modified, deleted), and time stamp, and publish this event using the Event Bus API.",
      "dependencies": [],
      "version": 1,
      "created_at": "2026-01-30T05:22:40.905490Z",
      "updated_at": "2026-01-30T05:22:40.905503Z"
    },
    "soma.memory.journal": {
      "name": "soma.memory.journal",
      "description": "This organ will be responsible for maintaining a persistent memory of file system events. It will subscribe to events published by the 'soma.perception.observer' and store relevant information about each event in a structured format, such as a database or log file. The journal will ensure that all changes detected by the observer are recorded, allowing the system to have a historical view of the file system state. This organ will use Python's built-in libraries for logging and configuration management to handle data persistence and retrieval.",
      "dependencies": [],
      "version": 1,
      "created_at": "2026-01-30T05:23:33.166499Z",
      "updated_at": "2026-01-30T05:23:33.166514Z"
    },
    "soma.visualization.dashboard": {
      "name": "soma.visualization.dashboard",
      "description": "This organ will be responsible for providing a visual dashboard that displays real-time and historical data about the file system changes. It will subscribe to events published by the 'soma.memory.journal' and use this information to update the dashboard in real-time. The dashboard will provide an interface where users can view file paths, types of changes, timestamps, and other relevant metrics. This organ will utilize Python's web framework libraries such as Flask or Django to create a RESTful API that serves the dashboard frontend. The frontend can be built using HTML/CSS/JavaScript frameworks like React or Angular to provide a dynamic and interactive user experience.",
      "dependencies": [],
      "version": 1,
      "created_at": "2026-01-30T05:24:20.083886Z",
      "updated_at": "2026-01-30T05:24:20.083901Z"
    }
  },
  "goals": [
    {
      "description": "I must be able to perceive the file system.",
      "priority": 1,
      "satisfied": false,
      "created_at": "2026-01-30T05:22:12.860331Z",
      "required_organs": []
    },
    {
      "description": "I must have a memory.",
      "priority": 1,
      "satisfied": false,
      "created_at": "2026-01-30T05:22:12.860565Z",
      "required_organs": []
    },
    {
      "description": "I must have a visual dashboard.",
      "priority": 2,
      "satisfied": false,
      "created_at": "2026-01-30T05:22:12.860568Z",
      "required_organs": []
    }
  ],
  "active_modules": [
    "soma.perception.observer",
    "soma.memory.journal"
  ],
  "failures": [],
  "metadata": {
    "last_modified": "2026-01-30T05:24:20.085459Z",
    "total_evolutions": 2,
    "total_failures": 0,
    "last_successful_organ": "soma.memory.journal"
  }
}